load-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - flow:
    - get:
        url: "/api/health"